src/DataProcessors/Scan_НастройкиАРМ/Scan_НастройкиАРМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>Scan_НастройкиАРМ</name>
</mdclass:DataProcessor>

src/InformationRegisters/Scan_КонтрольныеТочкиАРМ/Scan_КонтрольныеТочкиАРМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_КонтрольныеТочкиАРМ</name>
  <resources>
    <name>АРМДилера</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>АРМОтделаЛогистики</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>АРМОтделаАдминистрирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>АРМОтделаПланирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>АРММенеджераПоКонтролюЗаказов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>DDИнформер</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РММенеджераДепартаментаПродаж</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>КонтрольнаяТочка</name>
    <type>
      <types>CatalogRef.Scan_КонтрольныеТочкиБизнесПроцессов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/DataProcessors/Scan_НастройкиАРМ/Forms/Форма/Module.bsl
//rarus tenkam 15.06.2016 mantis 6925 ++
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПервоначальноеЗаполнениеКТ();
	ЗаполнитьКонтрольныеТочкиКарточкиЗаказаИзРегистра();
	Scan_СборСтатистики.Scan_ПриОткрытииОбработки(РеквизитФормыВЗначение("Объект").Метаданные().Синоним); // Rarus tenkam 11.04.2022 mantis 18433 +

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// КОНТРОЛЬНЫЕ ТОЧКИ

&НаСервере
Процедура ПервоначальноеЗаполнениеКТ()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Scan_КонтрольныеТочкиАРМ.КонтрольнаяТочка
	               |ИЗ
	               |	РегистрСведений.Scan_КонтрольныеТочкиАРМ КАК Scan_КонтрольныеТочкиАРМ";
	Если Запрос.Выполнить().Пустой() Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	Scan_КонтрольныеТочкиБизнесПроцессов.Ссылка КАК КонтрольнаяТочка
		               |ИЗ
		               |	Справочник.Scan_КонтрольныеТочкиБизнесПроцессов КАК Scan_КонтрольныеТочкиБизнесПроцессов
		               |ГДЕ
		               |	(Scan_КонтрольныеТочкиБизнесПроцессов.ОбъектМетаданных = ""Scan_ЗаказыНаЗавод""
		               |			ИЛИ Scan_КонтрольныеТочкиБизнесПроцессов.ОбъектМетаданных = ""Scan_Продукты"" //rarus sergei 15.08.2016 mantis 7110 + 
					   |			ИЛИ Scan_КонтрольныеТочкиБизнесПроцессов.ОбъектМетаданных = ""Scan_Изделия"")"; //rarus tenkam 03.04.2017 mantis 9191 + 
		Результат = Запрос.Выполнить().Выгрузить();
		
		НаборЗаписей = РегистрыСведений.Scan_КонтрольныеТочкиАРМ.СоздатьНаборЗаписей();
		Для Каждого СтрокаРезультата Из Результат Цикл
			НоваяЗапись = НаборЗаписей.Добавить();
			
			НоваяЗапись.КонтрольнаяТочка = СтрокаРезультата.КонтрольнаяТочка;
			НоваяЗапись.АРМОтделаЛогистики = Ложь;
			НоваяЗапись.АРМОтделаАдминистрирования = Ложь;
			НоваяЗапись.АРМОтделаПланирования = Ложь;
			НоваяЗапись.АРММенеджераПоКонтролюЗаказов = Ложь; //rarus BProg_Dekin 11.03.2020 mantis 0015725 +-
			НоваяЗапись.АРМДилера = Ложь; //rarus ozhnik 17366 18.03.2021 + 
			НоваяЗапись.DDИнформер = Ложь; //rarus vikhle 19.10.2020 mt 16328
			НоваяЗапись.РММенеджераДепартаментаПродаж = Ложь; // rarus vikhle 08.12.2021 m 18500
			НоваяЗапись.Пользователь = ПользователиКлиентСервер.ТекущийПользователь();
			
		КонецЦикла;
		НаборЗаписей.Записать();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКонтрольныеТочкиКарточкиЗаказаИзРегистра()
	НастройкиКТ.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Scan_КонтрольныеТочкиАРМ.КонтрольнаяТочка КАК КонтрольнаяТочка,
	               |	Scan_КонтрольныеТочкиАРМ.АРМОтделаЛогистики КАК АРМОтделаЛогистики,
	               |	Scan_КонтрольныеТочкиАРМ.АРМОтделаАдминистрирования КАК АРМОтделаАдминистрирования,
	               |	Scan_КонтрольныеТочкиАРМ.АРМОтделаПланирования КАК АРМОтделаПланирования,
	               |	Scan_КонтрольныеТочкиАРМ.АРММенеджераПоКонтролюЗаказов КАК АРММенеджераПоКонтролюЗаказов,
	               |	Scan_КонтрольныеТочкиАРМ.АРМДилера КАК АРМДилера,
	               |	Scan_КонтрольныеТочкиАРМ.DDИнформер КАК DDИнформер,
	               |	Scan_КонтрольныеТочкиАРМ.РММенеджераДепартаментаПродаж КАК РММенеджераДепартаментаПродаж
	               |ИЗ
	               |	РегистрСведений.Scan_КонтрольныеТочкиАРМ КАК Scan_КонтрольныеТочкиАРМ
	               |ГДЕ
	               |	(Scan_КонтрольныеТочкиАРМ.КонтрольнаяТочка.ОбъектМетаданных = ""Scan_ЗаказыНаЗавод""
	               |			ИЛИ Scan_КонтрольныеТочкиАРМ.КонтрольнаяТочка.ОбъектМетаданных = ""Scan_Продукты""
	               |			ИЛИ Scan_КонтрольныеТочкиАРМ.КонтрольнаяТочка.ОбъектМетаданных = ""Scan_КлючевыеДатыРегистрСведений""
	               |			ИЛИ Scan_КонтрольныеТочкиАРМ.КонтрольнаяТочка.ОбъектМетаданных = ""Scan_Изделия"")"; //rarus tenkam 03.04.2017 mantis 9191 + 
	//rarus vikhle 19.10.2020 mt 16328 +- добавил в запрос ресурс DDИнформер
	//rarus vikhle 08.12.2020 mt 18500 +- добавил в запрос ресурс РММенеджераДепартаментаПродаж
	Результат = Запрос.Выполнить().Выгрузить();
	Для Каждого СтрокаРезультата Из Результат Цикл
		СтрокаТЗ = НастройкиКТ.Добавить();	
		ЗаполнитьЗначенияСвойств(СтрокаТЗ,СтрокаРезультата);
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Процедура ОбновитьНастройкуКТВРегистре(ДанныеСтроки)
	//rarus bonmak 18.06.2021 17904 ++
	Если ДанныеСтроки.КонтрольнаяТочка.ПометкаУдаления Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Данная контрольная точка помечена на удаление. Использование запрещено'; en = 'This checkpoint is marked for deletion. Use is prohibited'");
		Сообщение.Сообщить();
		
		ЗаполнитьКонтрольныеТочкиКарточкиЗаказаИзРегистра();
		Возврат;
	КонецЕсли;
	//rarus bonmak 18.06.2021 17904 --
	
	НаборЗаписей = РегистрыСведений.Scan_КонтрольныеТочкиАРМ.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.КонтрольнаяТочка.Установить(ДанныеСтроки.КонтрольнаяТочка);
	
	НоваяЗапись = НаборЗаписей.Добавить();
	
	НоваяЗапись.КонтрольнаяТочка = ДанныеСтроки.КонтрольнаяТочка;
	НоваяЗапись.АРМОтделаЛогистики = ДанныеСтроки.АРМОтделаЛогистики;
	НоваяЗапись.АРМОтделаАдминистрирования = ДанныеСтроки.АРМОтделаАдминистрирования;
	НоваяЗапись.АРМОтделаПланирования = ДанныеСтроки.АРМОтделаПланирования;
	НоваяЗапись.АРММенеджераПоКонтролюЗаказов = ДанныеСтроки.АРММенеджераПоКонтролюЗаказов;  //rarus BProg_Dekin 11.03.2020 mantis 0015725 +-
	НоваяЗапись.АРМДилера = ДанныеСтроки.АРМДилера; //rarus ozhnik 17366 18.03.2021 + 
	НоваяЗапись.DDИнформер = ДанныеСтроки.DDИнформер; //rarus vikhle 19.10.2020 mt 16328	
	НоваяЗапись.РММенеджераДепартаментаПродаж = ДанныеСтроки.РММенеджераДепартаментаПродаж; //rarus vikhle 08.12.2020 mt 18500
	НоваяЗапись.Пользователь = ПользователиКлиентСервер.ТекущийПользователь();
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

//rarus bonmak 01.08.2019 14427 закомментировал ++
//&НаСервере
//Функция ПроверитьВозможностьВнесенияИзменений(ДанныеСтроки) //rarus bonmak 01.07.2019 14433 ++
//	Отказ = Ложь;
//	Если ДанныеСтроки.КонтрольнаяТочка.ОбъектМетаданных = "Scan_КлючевыеДатыРегистрСведений" Тогда
//		Отказ = Истина;
//	КонецЕсли;
//	Возврат Отказ;		
//КонецФункции //rarus bonmak 01.07.2019 14433 --
//rarus bonmak 01.08.2019 14427 закомментировал --

&НаКлиенте
Процедура ОбновитьНастройкиКТ(Команда)
	ЗаполнитьКонтрольныеТочкиКарточкиЗаказаИзРегистра();
КонецПроцедуры

&НаКлиенте
Процедура НастройкиКТАРМОтделаЛогистикиПриИзменении(Элемент)
	СтруктураДанных = ПолучитьСтруктуруДанных(Элементы.НастройкиКТ.ТекущиеДанные);
	//rarus bonmak 01.08.2019 14427 закомментировал
	//Отказ = ПроверитьВозможностьВнесенияИзменений(СтруктураДанных); //rarus bonmak 01.07.2019 14433
	//Если Отказ Тогда //rarus bonmak 01.07.2019 14433 добавил условие и отработку ИСТИНА
	//	Элементы.НастройкиКТ.ТекущиеДанные.АРМОтделаЛогистики = Ложь;
	//	Элементы.НастройкиКТ.ТекущиеДанные.АРМОтделаАдминистрирования = Ложь;
	//	Сообщить(НСтр("ru = 'Временно, запрещено использовать контролькую точку в данном АРМ!'; en = 'Temporarily, it is forbidden to use the control point in this AWS!'"));
	//Иначе
	ОбновитьНастройкуКТВРегистре(СтруктураДанных);
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НастройкиКТАРМОтделаАдминистрированияПриИзменении(Элемент)
	СтруктураДанных = ПолучитьСтруктуруДанных(Элементы.НастройкиКТ.ТекущиеДанные);
	//rarus bonmak 01.08.2019 14427 закомментировал
	//Отказ = ПроверитьВозможностьВнесенияИзменений(СтруктураДанных); //rarus bonmak 01.07.2019 14433
	//Если Отказ Тогда //rarus bonmak 01.07.2019 14433 добавил условие и отработку ИСТИНА
	//	Элементы.НастройкиКТ.ТекущиеДанные.АРМОтделаЛогистики = Ложь;
	//	Элементы.НастройкиКТ.ТекущиеДанные.АРМОтделаАдминистрирования = Ложь;
	//	Сообщить(НСтр("ru = 'Временно, запрещено использовать контролькую точку в данном АРМ!'; en = 'Temporarily, it is forbidden to use the control point in this AWS!'"));
	//Иначе
	ОбновитьНастройкуКТВРегистре(СтруктураДанных);
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НастройкиКТАРМОтделаПланированияПриИзменении(Элемент)
	СтруктураДанных = ПолучитьСтруктуруДанных(Элементы.НастройкиКТ.ТекущиеДанные);
	ОбновитьНастройкуКТВРегистре(СтруктураДанных);
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСтруктуруДанных(ДанныеФормы)
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("КонтрольнаяТочка",ДанныеФормы.КонтрольнаяТочка);
	СтруктураДанных.Вставить("АРМОтделаЛогистики",ДанныеФормы.АРМОтделаЛогистики);
	СтруктураДанных.Вставить("АРМОтделаАдминистрирования",ДанныеФормы.АРМОтделаАдминистрирования);
	СтруктураДанных.Вставить("АРМОтделаПланирования",ДанныеФормы.АРМОтделаПланирования);
	СтруктураДанных.Вставить("АРММенеджераПоКонтролюЗаказов",ДанныеФормы.АРММенеджераПоКонтролюЗаказов);
	СтруктураДанных.Вставить("АРМДилера",ДанныеФормы.АРМДилера); //rarus ozhnik 17366 18.03.2021 + 
	СтруктураДанных.Вставить("DDИнформер",ДанныеФормы.DDИнформер); //rarus vikhle 19.10.2020 mt 16328
	СтруктураДанных.Вставить("РММенеджераДепартаментаПродаж", ДанныеФормы.РММенеджераДепартаментаПродаж); //rarus vikhle 08.12.2020 mt 18500
	Возврат СтруктураДанных;
КонецФункции

&НаКлиенте
Процедура НастройкиКТАРММенеджераПоКонтролюЗаказовПриИзменении(Элемент) //rarus BProg_Dekin 11.03.2020 mantis 0015725 +-
	СтруктураДанных = ПолучитьСтруктуруДанных(Элементы.НастройкиКТ.ТекущиеДанные);
	ОбновитьНастройкуКТВРегистре(СтруктураДанных);
КонецПроцедуры

&НаКлиенте
Процедура НастройкиКТDDИнформерПриИзменении(Элемент)
	//rarus vikhle 19.10.2020 mt 16328
	СтруктураДанных = ПолучитьСтруктуруДанных(Элементы.НастройкиКТ.ТекущиеДанные);
	ОбновитьНастройкуКТВРегистре(СтруктураДанных);
	//rarus vikhle 19.10.2020 mt 16328
КонецПроцедуры


//rarus tenkam 15.06.2016 mantis 6925 --

//rarus ozhnik 17366 18.03.2021 + 
&НаКлиенте
Процедура НастройкиКТАРМДилераПриИзменении(Элемент)
	СтруктураДанных = ПолучитьСтруктуруДанных(Элементы.НастройкиКТ.ТекущиеДанные);
	ОбновитьНастройкуКТВРегистре(СтруктураДанных);
	//rarus ozhnik 17366 18.03.2021 -
КонецПроцедуры

&НаКлиенте
Процедура НастройкиКТРММенеджераДепартаментаПродажПриИзменении(Элемент)
	//rarus vikhle 08.12.2021 mt 18500 +++
	СтруктураДанных = ПолучитьСтруктуруДанных(Элементы.НастройкиКТ.ТекущиеДанные);
	ОбновитьНастройкуКТВРегистре(СтруктураДанных);
	//rarus vikhle 08.12.2021 mt 18500 ---
КонецПроцедуры
